src/InformationRegisters/Диалоги/Диалоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Диалоги</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>UID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СоцСеть</name>
    <type>
      <types>EnumRef.СоцСети</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СоцСети/СоцСети.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СоцСети</name>
  <enumValues>
    <name>VK</name>
  </enumValues>
  <enumValues>
    <name>Telegram</name>
  </enumValues>
  <enumValues>
    <name>VKT</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Сообщества/Сообщества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сообщества</name>
  <predefined>
    <items>
      <name>Athenaeum</name>
      <description>Two- Digit Athenaeum</description>
    </items>
    <items>
      <name>ОИ</name>
      <description>Ого, искусство!</description>
    </items>
    <items>
      <name>ПиБ</name>
      <description>Прах и Бархат</description>
    </items>
    <items>
      <name>Тест</name>
      <description>Тест</description>
    </items>
  </predefined>
  <attributes>
    <name>ВК_ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_V</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_owner_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_client_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_access_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_client_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_communitysecret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_communitytoken</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_chat_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаVK</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>TGB_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDАльбома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПостовВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_НомерКомпании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_Кабинет</name>
    <type>
      <types>CatalogRef.РекламныеКабинеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВК_ДневнойЛимитНаЗапись</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_НомерКатегории</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбъявлений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйУровеньПоста</name>
    <type>
      <types>EnumRef.УровниПостов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСообществ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщества</name>
    <type>
      <types>EnumRef.ТипыСообществ</types>
    </type>
  </attributes>
  <attributes>
    <name>РаскруткаБотами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лого</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСложноПосты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСложнопостов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьСтатистику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Объявления</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОбновления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <predefined>
    <items>
      <name>Ферапонт</name>
      <description>Ферапонт</description>
    </items>
    <items>
      <name>ЭтотПользователь</name>
      <description>Этот пользователь</description>
    </items>
  </predefined>
  <attributes>
    <name>Telegram</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VK</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Никнейм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешилПисатьVK</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеНастройки</name>
    <type>
      <types>CatalogRef.ПерсональныеНастройки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_БотОстановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/МетодыРаботыTelegram/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ОтправитьКартинку(Знач Сообщество, Знач Текст, Знач Картинка) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("caption"			, Текст); 
	Параметры.Вставить("protect_content"	, "true");
	Параметры.Вставить("token"				, Сообщество.ТГ_token);
	Параметры.Вставить("chat_id"			, Сообщество.ТГ_chat_id);
	
	СтруктураФайлов = Новый Структура;
	СтруктураФайлов.Вставить("photo",  Картинка);
	
	Ответ = МетодыРаботыHttp.Post("https://api.telegram.org/bot" + Параметры.token + "/sendPhoto", Параметры, СтруктураФайлов); 

	Возврат Ответ;
	
КонецФункции

Функция ОтправитьГруппуКартинок(Знач Сообщество, Знач Текст, Знач МассивКартинок) Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("protect_content", "true");
	Параметры.Вставить("token"				, Сообщество.ТГ_token);
	Параметры.Вставить("chat_id"			, Сообщество.ТГ_chat_id);

	Медиа 			= Новый Массив;	
	СтруктураФайлов = Новый Структура;
	Счетчик			= 0;
	
	Для Каждого КартинкаМассива Из МассивКартинок Цикл
		
		ФайлСуществует = Ложь;
		
		Если ТипЗнч(КартинкаМассива) = Тип("Строка") Тогда
			ФайлПути 		= Новый Файл(КартинкаМассива);
			ФайлСуществует  = ФайлПути.Существует();
		Иначе
			ФайлСуществует = Истина;
		КонецЕсли;

		Если ФайлСуществует Тогда
			
			СтруктураФайлов.Вставить("photo" + Строка(Счетчик),  КартинкаМассива);
			
			СтруктураМедиа = Новый Структура;
			СтруктураМедиа.Вставить("type", "photo");
			СтруктураМедиа.Вставить("media", "attach://" + "photo" + Строка(Счетчик));
			
			Если Счетчик = 0 Тогда
				СтруктураМедиа.Вставить("caption", Текст);
			КонецЕсли;
			
			Медиа.Добавить(СтруктураМедиа);
			
			Счетчик = Счетчик + 1;
			
		КонецЕсли;
				
	КонецЦикла;

	Параметры.Вставить("media", МетодыРаботыHttp.JSONСтрокой(Медиа));
	
	Ответ = МетодыРаботыHttp.Post("https://api.telegram.org/bot" + Параметры.token + "/sendMediaGroup", Параметры, СтруктураФайлов); 

	Возврат Ответ;

КонецФункции

Функция ОтправитьСообщение(Знач IDЧата, Знач Текст, Знач Клавиатура = "") Экспорт
    
    МетодыРаботыHttp.ЗаменитьСпецсимволы(Текст);
    IDЧата = МетодыРаботыHttp.ЧислоВСтроку(IDЧата);
	Токен  = ИнструментарийВызовСервера.ЗначениеРеквизитаОбъекта(Справочники.Сообщества.Athenaeum, "TGB_token"); 

	Если Не ЗначениеЗаполнено(Клавиатура) Тогда
   	
		Строки = Новый Массив;
		Кнопки = Новый Массив;
		
		Кнопки.Добавить(Новый Структура("text,callback_data","<-"	,"<-"));
		Кнопки.Добавить(Новый Структура("text,callback_data","->"	,"->"));
		
		Строки.Добавить(Кнопки);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет,,,ЭкранированиеСимволовJSON.СимволыВнеASCII));
		ЗаписатьJSON(ЗаписьJSON, Новый Структура("keyboard,resize_keyboard",Строки, Истина));
		
		Клавиатура = ЗаписьJSON.Закрыть();
	
	КонецЕсли;
	
	_Параметры = Новый Структура;
	_Параметры.Вставить("parse_mode"    , "Markdown");
	_Параметры.Вставить("text"          , Текст);
	_Параметры.Вставить("chat_id"       , IDЧата);
	_Параметры.Вставить("reply_markup"  , Клавиатура);
	
	
    Ответ = МетодыРаботыHttp.Get("api.telegram.org/bot" + Токен + "/sendMessage", _Параметры);
		
	РегистрыСведений.Диалоги.ЗаписатьСообщениеДиалога(Справочники.Пользователи.Ферапонт
	, Справочники.Пользователи.НайтиПоРеквизиту("Telegram", IDЧата)
	, Перечисления.СоцСети.Telegram
	, Текст);
	
    Возврат Ответ;
    
КонецФункции

Функция СформироватьКлавиатуруПоМассивуКнопок(Знач МассивКнопок, Знач ПодСообщением = Ложь) Экспорт
	
	Строки = Новый Массив;
		
	Для Каждого Кнопка Из МассивКнопок Цикл
		
		Кнопки = Новый Массив;
		Кнопка = МетодыРаботыHttp.ЧислоВСтроку(Кнопка);
		Кнопки.Добавить(Новый Структура("text,callback_data", Кнопка, Кнопка));
		Строки.Добавить(Кнопки);

	КонецЦикла;
	
	
	Если ПодСообщением Тогда
		СтруктураПараметра = Новый Структура("inline_keyboard,rows", Строки, 1);
	Иначе
		СтруктураПараметра = Новый Структура("keyboard,resize_keyboard", Строки, Истина)
	КонецЕсли;
	
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет,,,ЭкранированиеСимволовJSON.СимволыВнеASCII));
	ЗаписатьJSON(ЗаписьJSON, СтруктураПараметра);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

#КонецОбласти
